"""
Напишіть програму на Python, яка включає функцію greeting, що виводить вітальне повідомлення, та викличте цю функцію.

Задачі:

Створіть функцію з назвою greeting.
Усередині функції використовуйте команду print для виведення повідомлення "Hello world!".
Після оголошення функції, викличте її, щоб побачити повідомлення на екрані.
Очікуваний результат:

Коли програма виконується, вона має вивести "Hello world!" на екран.

Підказки:

Виклик функції виконується за допомогою її імені та пари круглих дужок.
"""
def greeting ():
    print("Hello world!")

greeting()