"""
Крок третій. В основному завданні є умова. "Оскільки дні народження колег можуть припадати на вихідні, 
ваша функція також повинна враховувати це та переносити дату привітання на наступний робочий день, якщо це необхідно".

Отже, щоб виконати таку дію нам потрібен пошук дати наступного конкретного дня тижня від конкретної дати.

На цьому кроці вам потрібно створити функцію find_next_weekday, яка дозволяє знайти дату наступного конкретного дня тижня після заданої дати. 
Це особливо корисно для перенесення дати вітання колег, якщо їхні дні народження припадають на вихідні.

Параметри:

start_date - дата, від якої починається пошук (у форматі об'єкта дати).
weekday - день тижня, який потрібно знайти. Приймає значення від 0 (понеділок) до 6 (неділя). За замовчуванням встановлено 0 (понеділок), 
оскільки це найчастіше потрібно для перенесення дат.
Функція має знайти та повернути наступну дату заданого дня тижня, починаючи від start_date. Наприклад, якщо start_date — це вівторок, 
і вам потрібен наступний понеділок, функція повинна повернути дату наступного понеділка.

Наприклад, ви хочете знайти наступний понеділок і наступну п'ятницю після 26 березня 2024 року. Використання вашої функції має виглядати так:

start_date = string_to_date("2024.03.26")  # Перетворення рядка на дату
next_monday = find_next_weekday(start_date, 0)  # Знайти наступний понеділок
print(next_monday)
next_friday = find_next_weekday(start_date, 4)  # Знайти наступну п'ятницю
print(next_friday)
Повинно призводити до виведення:

2024 - 04 - 01
2024 - 03 - 29
Бо для вівторка 26 березня 2024 року наступна п'ятниця буде 29 березня на тому ж тижні, а наступний понеділок вже 1 квітня наступного тижня. 
Приклад демонструє, що функція універсальна і може застосовуватися для будь-якого дня тижня.
"""

from datetime import datetime, timedelta


def string_to_date(date_string):                                #дана ф-я перетворює рядок в дату
    return datetime.strptime(date_string, "%Y.%m.%d").date()

def find_next_weekday(start_date, weekday):                     #дана ф-я шукає наступний вказаний день-weekday від вказаної дати-start_date
    day_of_week = start_date.weekday()                          #знаходимо який день тижня вказано в даті
    days_ahead = weekday - day_of_week                          #знаходимо різницю між поточною та шуканою датою
    if days_ahead <= 0:
        days_ahead += 7
    return start_date + timedelta(days=days_ahead)   

start_date = string_to_date("2024.03.26")  # Перетворення рядка на дату

next_monday = find_next_weekday(start_date, 0)  # Знайти наступний понеділок
print(next_monday)

next_friday = find_next_weekday(start_date, 4)  # Знайти наступну п'ятницю
print(next_friday)